reports/examples/browser-screenshot-test/k6-summary-2025-11-30_11-08-43-190Z.txt


  █ THRESHOLDS 

    checks
    ✓ 'rate==1.0' rate=100.00%


  █ TOTAL RESULTS 

    checks_total.......................: 1       0.091044/s
    checks_succeeded...................: 100.00% 1 out of 1
    checks_failed......................: 0.00%   0 out of 1

    ✓ header is visible

    EXECUTION
    iteration_duration...................................: min=3661.82ms avg=3661.82ms med=3661.82ms max=3661.82ms p(90)=3661.82ms p(95)=3661.82ms p(99)=3661.82ms p(99.9)=3661.82ms
    iterations...........................................: 1      0.091044/s
    vus..................................................: 1      min=1      max=1
    vus_max..............................................: 1      min=1      max=1

    NETWORK
    data_received........................................: 0 B    0 B/s
    data_sent............................................: 0 B    0 B/s

    BROWSER
    browser_data_received................................: 1.7 kB 159 B/s
    browser_data_sent....................................: 414 B  38 B/s
    browser_http_req_duration............................: min=236.31ms  avg=595.51ms  med=595.51ms  max=954.72ms  p(90)=882.88ms  p(95)=918.80ms  p(99)=947.54ms  p(99.9)=954.00ms 
    browser_http_req_failed..............................: 50.00% 1 out of 2

    WEB_VITALS
    browser_web_vital_cls................................: min=0         avg=0         med=0         max=0         p(90)=0         p(95)=0         p(99)=0         p(99.9)=0        
    browser_web_vital_fcp................................: min=1288.00ms avg=1288.00ms med=1288.00ms max=1288.00ms p(90)=1288.00ms p(95)=1288.00ms p(99)=1288.00ms p(99.9)=1288.00ms
    browser_web_vital_lcp................................: min=1288.00ms avg=1288.00ms med=1288.00ms max=1288.00ms p(90)=1288.00ms p(95)=1288.00ms p(99)=1288.00ms p(99.9)=1288.00ms
    browser_web_vital_ttfb...............................: min=959.50ms  avg=959.50ms  med=959.50ms  max=959.50ms  p(90)=959.50ms  p(95)=959.50ms  p(99)=959.50ms  p(99.9)=959.50ms 


  █ SCENARIO: browser 

    checks_total.......................: 1       0.091044/s
    checks_succeeded...................: 100.00% 1 out of 1
    checks_failed......................: 0.00%   0 out of 1

    ✓ header is visible

    EXECUTION
    iteration_duration...................................: min=3661.82ms avg=3661.82ms med=3661.82ms max=3661.82ms p(90)=3661.82ms p(95)=3661.82ms p(99)=3661.82ms p(99.9)=3661.82ms
    iterations...........................................: 1      0.091044/s

    NETWORK
    data_received........................................: 0 B    0 B/s
    data_sent............................................: 0 B    0 B/s

    BROWSER
    browser_data_received................................: 1.7 kB 159 B/s
    browser_data_sent....................................: 414 B  38 B/s
    browser_http_req_duration............................: min=236.31ms  avg=595.51ms  med=595.51ms  max=954.72ms  p(90)=882.88ms  p(95)=918.80ms  p(99)=947.54ms  p(99.9)=954.00ms 
    browser_http_req_failed..............................: 50.00% 1 out of 2

    WEB_VITALS
    browser_web_vital_cls................................: min=0         avg=0         med=0         max=0         p(90)=0         p(95)=0         p(99)=0         p(99.9)=0        
    browser_web_vital_fcp................................: min=1288.00ms avg=1288.00ms med=1288.00ms max=1288.00ms p(90)=1288.00ms p(95)=1288.00ms p(99)=1288.00ms p(99.9)=1288.00ms
    browser_web_vital_lcp................................: min=1288.00ms avg=1288.00ms med=1288.00ms max=1288.00ms p(90)=1288.00ms p(95)=1288.00ms p(99)=1288.00ms p(99.9)=1288.00ms
    browser_web_vital_ttfb...............................: min=959.50ms  avg=959.50ms  med=959.50ms  max=959.50ms  p(90)=959.50ms  p(95)=959.50ms  p(99)=959.50ms  p(99.9)=959.50ms 



running (00m11.0s), 0/1 VUs, 1 complete and 0 interrupted iterations
browser ✓ [ 100% ] 1 VUs  00m11.0s/10m0s  1/1 shared iters